import pandas as pd
from datetime import datetime
from services.get_data import get_data
from tqdm import tqdm

if __name__ == "__main__":
    symbols = [
        '0052', '0053', '0055', '00662', '00671R', '00678', '00712', '00714', '00728', '00735', 
        '00737', '00757', '00762', '00770', '00830', '00851', '00861', '00875', '00876', '00877', 
        '00881', '00886', '00887', '00891', '00892', '00895', '00896', '00897', '00898', '00899', 
        '00901', '00902', '00903', '00904', '00908', '00911', '00679B', '00687B', '00694B', '00695B', 
        '00696B', '00697B', '00719B', '00764B', '00768B', '00779B', '00795B', '00847B', '00856B', 
        '00857B', '00859B', '00864B', '00865B', '00931B', '00720B', '00722B', '00723B', '00724B', 
        '00725B', '00734B', '00740B', '00746B', '00749B', '00750B', '00751B', '00754B', '00755B', 
        '00759B', '00761B', '00772B', '00773B', '00775B', '00777B', '00778B', '00780B', '00781B', 
        '00782B', '00785B', '00786B', '00787B', '00788B', '00789B', '00790B', '00791B', '00792B', 
        '00793B', '00799B', '00834B', '00836B', '00840B', '00841B', '00842B', '00844B', '00845B', 
        '00846B', '00853B', '00860B', '00862B', '00863B', '00867B', '00883B', '00890B', '00937B', 
        '00942B', '00711B', '00718B', '00726B', '00756B', '00760B', '00784B', '00794B', '00848B', 
        '00849B', '00870B', '00884B', '00635U', '00642U', '00673R', '00674R', '00693U', '00708L', 
        '00715L', '00738U', '00763U', '00682U', '00683L', '00684R', '00706L', '00707R'
    ]

    current_date = datetime.now().strftime("%Y-%m-%d")
    print(f"開始抓取 ETF 資料，日期: {current_date}")
    all_data = []

    for symbol in tqdm(symbols, desc="處理 ETF 代號"):
        data = get_data(symbol)

        combined_data = {
            "Date": current_date,
            "Symbol": symbol,
            **data
        }

        all_data.append(combined_data)

        # 將資料轉換為 DataFrame 並即時寫入 Excel
        df = pd.DataFrame(all_data)
        df.to_excel("output/etf_data.xlsx", index=False)

    print("ETF 資料抓取與匯出完成。")
